/*

7-4转置矩阵：
7 0 6 8 1
2 1 4 2 4
0 0 2 7 9
9 5 0 3 6

矩阵7-4与其转置矩阵的乘积：

规模(5 * 5)

134 47 50 87 69
47  26 4  17 34
50  4  56 70 40
87  17 70 126 97
69  34 40 97 134

*/

#include"../case/7-2.cpp"

int main()
{
    matrix<int> m1(5, 4), m1Trans(4, 5);

    m1(1, 1) = 7;
    m1(1, 2) = 2;
    m1(1, 3) = 0;
    m1(1, 4) = 9;

    m1(2, 1) = 0;
    m1(2, 2) = 1;
    m1(2, 3) = 0;
    m1(2, 4) = 5;

    m1(3, 1) = 6;
    m1(3, 2) = 4;
    m1(3, 3) = 2;
    m1(3, 4) = 0;

    m1(4, 1) = 8;
    m1(4, 2) = 2;
    m1(4, 3) = 7;
    m1(4, 4) = 3;

    m1(5, 1) = 1;
    m1(5, 2) = 4;
    m1(5, 3) = 9;
    m1(5, 4) = 6;
/**************************/
    m1Trans(1, 1) = 7;
    m1Trans(1, 2) = 0;
    m1Trans(1, 3) = 6;
    m1Trans(1, 4) = 8;
    m1Trans(1, 5) = 1;

    m1Trans(2, 1) = 2;
    m1Trans(2, 2) = 1;
    m1Trans(2, 3) = 4;
    m1Trans(2, 4) = 2;
    m1Trans(2, 5) = 4;

    m1Trans(3, 1) = 0;
    m1Trans(3, 2) = 0;
    m1Trans(3, 3) = 2;
    m1Trans(3, 4) = 7;
    m1Trans(3, 5) = 9;

    m1Trans(4, 1) = 9;
    m1Trans(4, 2) = 5;
    m1Trans(4, 3) = 0;
    m1Trans(4, 4) = 3;
    m1Trans(4, 5) = 6;

    cout << "m1:" << endl << m1;
    cout << "m1Trans:" << endl << m1Trans;

    matrix<int> m2 = m1*m1Trans;
    cout << "m2:" << endl << m2;
}