/*
b = 27
num = [7, 42, 25, 70, 14, 38, 8, 21, 34, 11]

hashTable = [0, 0, 0, 0, 0, 0, 0, 7, 8, 34, 0, 38, 11, 0, 14, 42, 70, 0, 0, 0, 0, 21, 0, 0, 0, 25, 0]

插入最后一个关键字后，负载因子为：10/27 = 0.37

在一次失败搜索中，最多和平均查找次数为：
失败查找时，对当前位置需要的检验次数为：[1, 1, 1, 1, 1, 1, 1, 4, 3, 2, 1, 3, 2, 1, 4, 3, 2, 1, 1, 1, 1, 2, 1, 1, 1, 2, 1]
所以最多查找次数：4， 平均查找次数：44/27 = 1.6

在一次成功搜索中，最多和平均查找的桶数：
成功查找，需要检验的次数：[1, 1, 1, 1, 1, 1, 1, 1, 3, 2]
所以最多查找次数：3， 平均查找次数：13/10 = 1.3
*/

#include<iostream>
using namespace std;

int main()
{
    int a[] = {1, 1, 1, 1, 1, 1, 1, 4, 3, 2, 1, 3, 2, 1, 4, 3, 2, 1, 1, 1, 1, 2, 1, 1, 1, 2, 1};
    int sum = 0;
    for(int i = 0; i < 27; i++)
        sum += a[i];
    cout << sum;
}